tap "homebrew/bundle"
tap "homebrew/services"
tap "nasa-sw-vnv/core"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Generate compilation database for clang tooling
brew "bear"
# GNU compiler collection
brew "gcc"
# C++ interpreter
brew "cling"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# PDF Command-line Tools
brew "cpdf"
# DjVu viewer
brew "djvulibre"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Fork of prboom+ with a focus on speedrunning
brew "dsda-doom"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# I/O benchmark and stress test
brew "fio"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU typing tutor
brew "gnu-typist"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Numerical library for C and C++
brew "gsl"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# LaTeX-to-HTML translator
brew "latex2html"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Unix documentation system
brew "man-db"
# Incremental parsing library
brew "tree-sitter"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Open source computer vision library
brew "opencv"
# PDF processor written in Go
brew "pdfcpu"
# Port of pdftk in java
brew "pdftk-java"
# Package management made easy
brew "pixi"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# Show ps output as a tree
brew "pstree"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Steel Bank Common Lisp system
brew "sbcl"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Official documentation format of the GNU project
brew "texinfo"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# GNU compiler collection for x86_64-elf
brew "x86_64-elf-gcc"
# Binary diff, differential compression tools
brew "xdelta"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Communications service
cask "amazon-chime"
# Memory training application
cask "anki"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
# ZSA keyboard firmware flasher
cask "keymapp"
# GPU-based terminal emulator
cask "kitty"
# Desktop reader for Kobo eBooks
cask "kobo"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Sandbox construction video game
cask "minecraft"
# VPN client
cask "mullvad-vpn"
# Open-source software for live streaming and screen recording
cask "obs"
# Environment for statistical computing and graphics
cask "r-app"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Data science software focusing on R and Python
cask "rstudio"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Real time file synchronisation software
cask "syncthing-app"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Multi-platform VNC client and server
cask "tigervnc-viewer"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
